app/controllers/abilities_controller.rb

  def create
    @ability = Ability.new(ability_params)
    @ability.user = current_user
    respond_to do |format|
      if @ability.save
---
INSERT INTO "abilities" ("name", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["name", "yes"], ["created_at", 2017-06-10 02:25:33 UTC], ["updated_at", 2017-06-10 02:25:33 UTC], ["user_id", 1]]