app/controllers/attitudes_controller.rb

  def create
    @attitude = Attitude.new(attitude_params)

    respond_to do |format|
      if @attitude.save
---
INSERT INTO "attitudes" ("name", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["name", "lol"], ["created_at", 2017-06-10 02:46:03 UTC], ["updated_at", 2017-06-10 02:46:03 UTC], ["user_id", 1]]