app/controllers/feedbacks_controller.rb

  def create
    @feedback = Feedback.new(feedback_params)

    respond_to do |format|
      if @feedback.save
---
INSERT INTO "feedbacks" ("title", "body", "created_at", "updated_at", "plan_id", "feedback_giver_id") VALUES (?, ?, ?, ?, ?, ?)  [["title", "ad"], ["body", "aaa"], ["created_at", 2017-06-23 05:27:58 UTC], ["updated_at", 2017-06-23 05:27:58 UTC], ["plan_id", 5], ["feedback_giver_id", 2]]

    def set_feedback
      @feedback = Feedback.find(params[:id])
---
SELECT  "feedbacks".* FROM "feedbacks" WHERE "feedbacks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]