app/controllers/plans_controller.rb

  def index
    @plans = Plan.all.where(user_id: current_user.id)
    @shared = SharedPlan.where(user_id: current_user.id)
    @shared_plans = []
    @shared.each do |s|
---
SELECT "shared_plans".* FROM "shared_plans" WHERE "shared_plans"."user_id" = ?  [["user_id", 1]]
SELECT  "plans".* FROM "plans" WHERE "plans"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def show
    @feedback = Feedback.new
    @feedbacks = Feedback.where(plan_id: @plan.id)
---
SELECT "feedbacks".* FROM "feedbacks" WHERE "feedbacks"."plan_id" = ?  [["plan_id", 5]]

  def new
    @plan = Plan.new
    @grades = ['Pre-Kinder','Kinder','Primero Básico','Segundo Básico',
      'Tercero Básico','Cuarto Básico','Quinto Básico','Sexto Básico',
    'Séptimo Básico','Octavo Básico','Primero Medio','Segundo Medio',
  'Tercero Medio','Cuarto Medio']
    @subjects = ['Matemáticas','Lenguaje y Comunicación','Historia',
      'Educación Física','Música']
    @unit_plans = UnitPlan.all.where(user_id: current_user.id)
---
SELECT "unit_plans".* FROM "unit_plans" WHERE "unit_plans"."user_id" = ?  [["user_id", 1]]

  def create
    @plan = Plan.new(plan_params)
    unit_plans = params["plan"]["unit_plans"]
    unit_plans_objs = UnitPlan.where(id: unit_plans)
    unit_plans_objs.each do |l|
      @plan.unit_plans << l
---
SELECT "unit_plans".* FROM "unit_plans" WHERE "unit_plans"."id" IN (NULL, 1)
INSERT INTO "plans" ("grade", "subject", "total_hours", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["grade", "Pre-Kinder"], ["subject", "Matemáticas"], ["total_hours", 444], ["created_at", 2017-06-10 02:49:12 UTC], ["updated_at", 2017-06-10 02:49:12 UTC], ["user_id", 1]]
INSERT INTO "plans_unit_plans" ("unit_plan_id", "plan_id") VALUES (?, ?)  [["unit_plan_id", 1], ["plan_id", 1]]

  def share
    @plan = Plan.find_by(id: params['sharing']['plan_id'])
    @user = User.find_by(email: params['sharing']['user_email'])
    if(@user)
      @shared_plan = SharedPlan.new(user_id: @user.id, plan_id: @plan.id)
      @shared_plan.save
---
SELECT  "plans".* FROM "plans" WHERE "plans"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", ""], ["LIMIT", 1]]
INSERT INTO "shared_plans" ("plan_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["plan_id", 1], ["user_id", 1], ["created_at", 2017-06-23 03:12:35 UTC], ["updated_at", 2017-06-23 03:12:35 UTC]]

  def destroy
    @plan.destroy
---
DELETE FROM "plans" WHERE "plans"."id" = ?  [["id", 1]]

    def set_plan
      @plan = Plan.find(params[:id])
---
SELECT  "plans".* FROM "plans" WHERE "plans"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]