app/controllers/previous_learnings_controller.rb

  def create
    @previous_learning = PreviousLearning.new(previous_learning_params)

    respond_to do |format|
      if @previous_learning.save
---
INSERT INTO "previous_learnings" ("content", "generic_activity", "achievement_indicator", "estimated_time", "created_at", "updated_at", "title") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"