app/controllers/unit_plans_controller.rb

  def new
    @unit_plan = UnitPlan.new
    @previous_learnings = PreviousLearning.all
    @learning_objectives = LearningObjective.all
    @abilities = Ability.all
    @attitudes = Attitude.all
---
SELECT "previous_learnings".* FROM "previous_learnings"
SELECT "learning_objectives".* FROM "learning_objectives"
SELECT "abilities".* FROM "abilities"
SELECT "attitudes".* FROM "attitudes"