app/controllers/unit_plans_controller.rb

  def index
    @unit_plans = UnitPlan.all
---
SELECT "unit_plans".* FROM "unit_plans"

  def new
    @unit_plan = UnitPlan.new
    @previous_learnings = PreviousLearning.all.where(user_id: current_user.id)
    @learning_objectives = LearningObjective.all.where(user_id: current_user.id)
    @abilities = Ability.all.where(user_id: current_user.id)
    @attitudes = Attitude.all.where(user_id: current_user.id)
---
SELECT "previous_learnings".* FROM "previous_learnings" WHERE "previous_learnings"."user_id" = ?  [["user_id", 1]]
SELECT "learning_objectives".* FROM "learning_objectives" WHERE "learning_objectives"."user_id" = ?  [["user_id", 1]]
SELECT "abilities".* FROM "abilities" WHERE "abilities"."user_id" = ?  [["user_id", 1]]
SELECT "attitudes".* FROM "attitudes" WHERE "attitudes"."user_id" = ?  [["user_id", 1]]

  def create
    learning_objectives =  params["unit_plan"]["learning_objectives"]
    abilities = params["unit_plan"]["abilities"]
    attitudes = params["unit_plan"]["attitudes"]
    previous_learnings = params["unit_plan"]["previous_learnings"]

    learn_objectives_objs= LearningObjective.where(id: learning_objectives)
    abilities_objs = Ability.where(id: abilities)
    attitude_objs = Attitude.where(id: attitudes)
    previous_learnings_objs = PreviousLearning.where(id: previous_learnings)

    unit_plan_params_new = unit_plan_params.slice(:title, :total_hours_unit, :objective)
    @unit_plan = UnitPlan.new(unit_plan_params_new)

    learn_objectives_objs.each do |l|
      @unit_plan.learning_objectives << l
---
SELECT "learning_objectives".* FROM "learning_objectives" WHERE "learning_objectives"."id" IN (NULL, 1)
SELECT "abilities".* FROM "abilities" WHERE "abilities"."id" IN (NULL, 6)
SELECT "attitudes".* FROM "attitudes" WHERE "attitudes"."id" IN (NULL, 4)
SELECT "previous_learnings".* FROM "previous_learnings" WHERE "previous_learnings"."id" IN (NULL, 3)
INSERT INTO "abilities_unit_plans" ("unit_plan_id", "ability_id") VALUES (?, ?)  [["unit_plan_id", 2], ["ability_id", 6]]
INSERT INTO "attitudes_unit_plans" ("unit_plan_id", "attitude_id") VALUES (?, ?)  [["unit_plan_id", 2], ["attitude_id", 4]]
INSERT INTO "unit_plans" ("title", "total_hours_unit", "objective", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["title", "Una unidad"], ["total_hours_unit", 23], ["objective", "lol"], ["created_at", 2017-06-10 02:46:11 UTC], ["updated_at", 2017-06-10 02:46:11 UTC], ["user_id", 1]]

  def destroy
    @unit_plan.destroy
---
DELETE FROM "abilities_unit_plans" WHERE "abilities_unit_plans"."unit_plan_id" = ?  [["unit_plan_id", 1]]
DELETE FROM "attitudes_unit_plans" WHERE "attitudes_unit_plans"."unit_plan_id" = ?  [["unit_plan_id", 1]]
DELETE FROM "plans_unit_plans" WHERE "plans_unit_plans"."unit_plan_id" = ?  [["unit_plan_id", 1]]
DELETE FROM "unit_plans" WHERE "unit_plans"."id" = ?  [["id", 1]]

    def set_unit_plan
      @unit_plan = UnitPlan.find(params[:id])
---
SELECT  "unit_plans".* FROM "unit_plans" WHERE "unit_plans"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]