app/views/plans/index.html.erb

            <td><%= plan.total_hours %></td>
            <td><%= User.find_by(id: plan.user_id ) ? User.find_by(id: plan.user_id ).email : 'Usuario borrado'  %></td>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]