app/views/plans/show.html.erb

          Habilidades:</br>
          <% unit_plan.abilities.each do |ability| %>
---
SELECT "abilities".* FROM "abilities" INNER JOIN "abilities_unit_plans" ON "abilities"."id" = "abilities_unit_plans"."ability_id" WHERE "abilities_unit_plans"."unit_plan_id" = ?  [["unit_plan_id", 1]]

        <td class="actitudes_plan">
          <% unit_plan.attitudes.each do |attitude| %>
---
SELECT "attitudes".* FROM "attitudes" INNER JOIN "attitudes_unit_plans" ON "attitudes"."id" = "attitudes_unit_plans"."attitude_id" WHERE "attitudes_unit_plans"."unit_plan_id" = ?  [["unit_plan_id", 1]]

        <td class="contenidos_plan">
          <% unit_plan.previous_learnings.each do |previous_learning| %>
---
SELECT "previous_learnings".* FROM "previous_learnings" WHERE "previous_learnings"."unit_plan_id" = ?  [["unit_plan_id", 1]]

      <%= content_tag_for(:tr, @feedbacks) do |feedback| %>
            <td><%= User.find_by(id: feedback.feedback_giver_id) ? User.find_by(id: feedback.feedback_giver_id).email : 'Cuenta borrada' %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "feedbacks".* FROM "feedbacks" WHERE "feedbacks"."plan_id" = ?  [["plan_id", 5]]